"""
    Алгоритм Евклида. НОД - наибольший общий делитель

    1. Большее число делим на меньшее.
    2. Если делится без остатка, то меньшее число и есть НОД (выходим из цикла)
    3. Если есть остаток, то большее число заменяем на остаток от деления.
    4. Переходим к 1 пункту.

"""
try:
    a = int(input('Введіть значення a:'))
    b = int(input('Введіть значення b:'))
    if a < 0 or b < 0:
        print("Одне із чисел менше нуля")
    elif a == 0 or b == 0:
        print("Одне із чисел рівне нулю")
    else:
        while a != 0 and b != 0:
            if a >= b:
                a %= b
                if a % b == 0:
                    print('НСД:', b)
            else:
                b %= a
                if b % a == 0:
                    print('НСД:', a)
except ValueError:
    print("Введено невірне значення")












