"""
    Пользователь вводит начало и конец числового ряда.
    Если начало не введено - считать, что это 0.

    1. Программа считает и выводит на экран сумму числового ряда.
    2. Произведение нечетных чисел числового ряда.

    * обработать возможные ошибки
"""
try:
    a = int(input('Введіть значення a:'))
    b = int(input('Введіть значення b:'))
    result = 0
    mul = 1
    if a == 0:
        for i in range(b+1):
            result += i
        print('Сума ряду:', result)
        for i in range(b+1):
            if i % 2 != 0:
                mul *= i
        print('Добуток непарних чисел:', mul)
    else:
        for i in range(a, b+1):
            result += i
        print('Сума ряду:', result)
        for i in range(a, b+1):
            if i % 2 != 0:
                mul *= i
        print('Добуток непарних чисел:', mul)
except ValueError:
    print("Введено невірне значення")
